tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Isolated development environments using Docker
brew "docker-compose"
# macOS Credential Helper for Docker
brew "docker-credential-helper"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Configurable static site generator
brew "hugo"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Python dependency management tool
brew "pipenv"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# Argo Tunnel
brew "cloudflare/cloudflare/cloudflared"
cask "font-fira-code"
cask "gimp"
cask "gitkraken"
cask "hyper"
cask "java"
cask "jetbrains-toolbox"
cask "keybase"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
